Revit 2024 API
ElectricalLoadAreaData.HasCircuitsWithoutElectricalLoadAreas Method
 Checks whether there are any empty plan circuits in which there are no electrical load areas.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static bool HasCircuitsWithoutElectricalLoadAreas(
	Document doc,
	ElementId levelId,
	ElementId phaseId
)
Visual Basic
Public Shared Function HasCircuitsWithoutElectricalLoadAreas ( _
	doc As Document, _
	levelId As ElementId, _
	phaseId As ElementId _
) As Boolean
Visual C++
public:
static bool HasCircuitsWithoutElectricalLoadAreas(
	Document^ doc,
	ElementId^ levelId,
	ElementId^ phaseId
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document to check.
levelId
Type: Autodesk.Revit.DB.ElementId
 The base level on which the empty plan circuits to check.
phaseId
Type: Autodesk.Revit.DB.ElementId
 The associated phase in which the empty plan circuits to check.
Return Value
 True if there are empty plan circuits in which there are no electrical load areas, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  doc is not a project document. -or- The ElementId levelId is not a Level. -or- The id does not represent a valid phase.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace